In [3]:
def check_odd(number):
    if number % 2 != 0:
        print(f"{number} is odd")
    else:
        print(f"{number} is not odd")

In [4]:
check_odd(56)

56 is not odd

In [17]:
n = 5
for i in range(1, n + 1):
    print(' ' * (n - i) + '* ' * i, end='')
    print()

    *
   * *
  * * *
 * * * *
* * * * *

In [18]:
def add_hashtag(*company):
  result = []
  for i in company:
    result.append('#'+i.upper())
  return result

In [19]:
add_hashtag('ola','uber','rapido','indrive','adani','tata')

['#OLA', '#UBER', '#RAPIDO', '#INDRIVE', '#ADANI', '#TATA']

In [24]:
def factorial(n):
  result = 1
  for i in range(1,n+1):
      result *=i
  return result

In [25]:
factorial(8)

40320

In [31]:
def student_records(**kwargs):
  import pandas as pd
  try:
    data = pd.DataFrame(kwargs)
    return data
  except:
    data = pd.DataFrame(kwargs,index = [1])
    return data

In [32]:
student_records(Name = ['Anshika','Nameesh','Vanshika'],
                Age = [19,20,20],
                Address = ['UP','Haryana','Delhi'])

       Name  Age  Address
0   Anshika   19       UP
1   Nameesh   20  Haryana
2  Vanshika   20    Delhi